# 全局变量存储文件

# 时间间隔，单位分钟
TIME_INTERVAL = 15

# 存储电话号码
PHONE_NUM = '15528932507'

# 存储密码
PASSWORD = '123456'

# 判断开始结束的点数
NUM_POINTS = 2
CHANGE_LOWER = 400
CHANGE_UPPER = 500

# 设备档案
beeID = {
        '生活区': '86200001187',
        '学生办公区': '86200001289',
        '办公室/会议室': '86200001290',
    }
devices = {
    '生活区': {
        '打印机': 'Sck-M1-84f703126e44',
        '进门灯': 'Lk3-M1-7cdfa1b8a1a0',
        '小会议室灯': 'Lk1-M1-7cdfa1b8640c',
        '进门人体感应': 'Irs-M1-84f703112028',
        '展示区人体感应': 'Irs-M1-84f703122288',
        '小会议室人体感应': 'Irs-M1-84f7031218b4',
        '华为子路由器': 'Sck-M1-7cdfa1b608c8',
        '冰箱': ' Sck-M1-48ca43e5f64c',
        '网络设备': 'Sck-M1-7cdfa1b89d58',
        '咖啡机': ' Sck-M1-9c9e6e186d3c',
        '烧水壶': ' Sck-M1-9c9e6e186f14',
        '微波炉': ' Sck-M1-9c9e6e159b7c',
    },
    '学生办公区': {
        '人体感应1': 'Irs-M1-7cdfa1b84cb4',
        '人体感应2': 'Irs-M1-7cdfa1b85e28',
    },
    '办公室/会议室': {
        # 这几个人感不知道为什么查不到数据
        '大会议室人体感应器': 'Irs-M1-84f703101f5c',
        '办公室B人体感应器': 'Irs-M1-84f70310d0f4',
        '办公室B灯': 'Lk1-M1-7cdfa1b867d8',
        '办公室C人体感应器': 'Irs-M1-7cdfa1b85e50',
        '办公室C灯': 'Lk1-M1-7cdfa1b87b18',
        '办公室C空气传感器': 'Env-lt_0004@modbus 01',
        '办公室D灯': 'Lk1-M1-7cdfa1b84bc4',
        '办公室D空气传感器': 'Env-lt_0001@modbus 01',
        '大会议室灯': 'Lk2-M1-7cdfa1b86a10',
    }
}

Inductions = {
    '展示区人体感应1':{
        'beeID': '86200001187',
        'mac': 'Irs-M1-84f703112028'
    },
    '展示区人体感应2':{
        'beeID': '86200001187',
        'mac': 'Irs-M1-84f703122288'
    },
    '小会议室人体感应':{
        'beeID': '86200001187',
        'mac': 'Irs-M1-84f7031218b4'
    },
    '办公室B人体感应':{
        'beeID': '862000011183',
        'mac': 'Irs-M1-84f70310d0f4'
    },
    '办公室C人体感应':{
        'beeID': '862000011183',
        'mac': 'Irs-M1-7cdfa1b85e50'
    },
    '办公室D人体感应':{
        'beeID': '862000011183',
        'mac': 'Irs-M1-7cdfa1b84cd8'
    },
    '大会议室人体感应':{
        'beeID': '862000011183',
        'mac': 'Irs-M1-84f703101f5c'
    },
    '学生办公区人体感应1':{
        'beeID': '86200001289',
        'mac': 'Irs-M1-7cdfa1b85e28'
    },
    '学生办公区人体感应2':{
        'beeID': '86200001289',
        'mac': 'Irs-M1-7cdfa1b84cb4'
    },
}










